raw/03-client.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing"
            xmlns:e="http://schemas.xmlsoap.org/ws/2004/08/eventing"
            xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
            xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd">
    <s:Header>
        <a:To>https://picard:5986/owinec/subscriptions/s1</a:To>
        <m:MachineID xmlns:m="http://schemas.microsoft.com/wbem/wsman/1/machineid" s:mustUnderstand="false">Georgiou
        </m:MachineID>
        <a:ReplyTo>
            <a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous
            </a:Address>
        </a:ReplyTo>
        <a:Action s:mustUnderstand="true">http://schemas.dmtf.org/wbem/wsman/1/wsman/Heartbeat</a:Action>
        <w:MaxEnvelopeSize s:mustUnderstand="true">512000</w:MaxEnvelopeSize>
        <a:MessageID>uuid:AC597D74-4BD1-43C6-92E3-EA9D05DB7483</a:MessageID>
        <w:Locale xml:lang="de-DE" s:mustUnderstand="false"/>
        <p:DataLocale xml:lang="de-DE" s:mustUnderstand="false"/>
        <p:SessionId s:mustUnderstand="false">uuid:B2B1CEFD-2D51-4A0A-8406-B8B3492397E7</p:SessionId>
        <p:OperationID s:mustUnderstand="false">uuid:96A1742C-884D-4E23-BD81-B3FB70007F9D</p:OperationID>
        <p:SequenceId s:mustUnderstand="false">1</p:SequenceId>
        <w:OperationTimeout>PT60.000S</w:OperationTimeout>
        <e:Identifier xmlns:e="http://schemas.xmlsoap.org/ws/2004/08/eventing">75272085-1748-4772-B742-9B757E69AB9B
        </e:Identifier>
        <w:AckRequested/>
    </s:Header>
    <s:Body>
        <w:Events></w:Events>
    </s:Body>
</s:Envelope>
